SeeedWenzy/MeshPager_X2_PCBA/examples/test_fullfeatured/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.3.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=262144
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240



# CONFIG_ESP_CONSOLE_UART_CUSTOM=y
# CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_0=y
# CONFIG_ESP_CONSOLE_UART_TX_GPIO=20
# CONFIG_ESP_CONSOLE_UART_RX_GPIO=19
# CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set


CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_32B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_WRAP=y

CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y
CONFIG_ESP_WIFI_TX_BA_WIN=32
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_RX_BA_WIN=32

CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65535
CONFIG_LWIP_TCP_WND_DEFAULT=65535
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64

CONFIG_FATFS_LFN_STACK=y
# Defense-in-depth: SD card periodic job + media cache load both touch FATFS.
CONFIG_FATFS_FS_LOCK=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# BLE (NimBLE) for full-featured runner
CONFIG_BT_ENABLED=y
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BT_BLUEDROID_ENABLED=n
CONFIG_BT_NIMBLE_ENABLED=y

CONFIG_RADIO_SPI_HOST=1
CONFIG_RADIO_CS_GPIO=6
CONFIG_RADIO_SCK_GPIO=3
CONFIG_RADIO_MOSI_GPIO=4
CONFIG_RADIO_MISO_GPIO=5
CONFIG_RADIO_BUSY_GPIO=8
CONFIG_RADIO_INT_GPIO=7
CONFIG_RADIO_RST_GPIO=10





CONFIG_RUNNER_MIN_PERIOD_MS=100
CONFIG_RUNNER_PERIOD_DISPLAY_MS=60000
CONFIG_RUNNER_PERIOD_AUDIO_MS=60000
CONFIG_RUNNER_PERIOD_WIFI_MS=60000
CONFIG_RUNNER_PERIOD_BLE_MS=600000
CONFIG_RUNNER_PERIOD_GNSS_MS=60000
CONFIG_RUNNER_PERIOD_SENSOR_MS=60000
CONFIG_RUNNER_PERIOD_IMU_MS=60000
CONFIG_RUNNER_PERIOD_LORA_TX_MS=60000
CONFIG_RUNNER_PERIOD_LORA_RX_MS=60000
CONFIG_RUNNER_PERIOD_SDCARD_MS=60000
CONFIG_RUNNER_PERIOD_BATTERY_MS=60000
CONFIG_RUNNER_LORA_RX_ENABLED_BY_DEFAULT=y




